/* --------------------- 用例测试 ----------------------- */
// fib arr is like [0,1,1,2,3,5,8,13,21,34,55,......]
fib(4); // [0,1,1,2,3]
fib(10); // 0,1,1,2,3,5,8,13,21,34,55]

/* --------------------------------- Code solution 1: Recursion ------------------------------- */
const fib = (n) => {
  if (n === 0) return [0];
  if (n === 1) return [0, 1];

  const arr = fib(n - 1); //生成包含前n-1项的斐波那契数列，将其赋值给变量arr。
  arr.push(arr[arr.length - 1] + arr[arr.length - 2]); //每次递归调用中的这行代码都会根据之前生成的斐波那契数列的最后两项，计算并添加新的项到数组中，从而递归生成完整的斐波那契数列

  return arr;
};
